test/app/controllers/addresses_controller.rb

SELECT * FROM `regions` WHERE (`regions`.`id` = 10)
SELECT * FROM `provinces` WHERE (region_id = '10')
---
  def show_provinces
    @region = Region.find(params[:region_id])
    @provinces = Province.find(:all, :conditions => ["region_id = ?", params[:region_id]])