test/app/controllers/chedrecognitions_controller.rb

  def chedreg
    @school = current_user.school
    @school.chedreg_boardres = params[:chedreg]
    @school.save
---
UPDATE `schools` SET `updated_at` = '2010-05-23 17:47:33', `chedreg_boardres` = 'test' WHERE `id` = 1094

  def load_regions(school)
    @regions, @provinces, @towns = [], [], []
    regions = Region.find(:all, :order => "name")
    regions.each do |r|
      @regions << [r.name.titleize, r.id]
    end


    unless school.region.nil?
      region = school.region
      provinces = region.provinces
      provinces.find(:all, :order => "name").each do |p|
        @provinces << [ p.name.titleize, p.id]
      end

      unless school.province.nil?
        province = school.province
        towns = province.towns
        towns.find(:all, :order => "name").each do |t|
---
SELECT * FROM `regions` WHERE (`regions`.`id` = 10)
SELECT * FROM `regions`
SELECT * FROM `provinces` WHERE (`provinces`.region_id = 10)
SELECT * FROM `towns` WHERE (`towns`.province_id = 1)