test/app/controllers/noas_controller.rb

SELECT * FROM `examinees` WHERE (perrc IS NOT NULL)
---
  def history
    @examinees = Examinee.find(:all, :conditions => ["perrc IS NOT NULL"])

SELECT * FROM `test_centers`
---
  def load_test_centers
    @test_centers = [["Choose Below",'']]
    testcenters = PrcLocation.find(:all, :conditions => ["is_test_center = 1"])
    testcenters.each do |tc|