test/app/controllers/schools_controller.rb

  def index
    puts params.inspect
    @schools = School.search(params[:search], params[:page])
---
SELECT * FROM `schools` WHERE (name like '%%') ORDER BY name LIMIT 0, 20
SELECT count(*) AS count_all FROM `schools` WHERE (name like '%%')

  def new
    if request.post?
      school = School.new()
      school.name = params[:name]
      school.street_brgy = params[:street]
      school.prc_school_code = params[:prc_school_code]
      school.is_active = params[:status]
      school.created_by = current_user.id
      address = Address.new
      address.area_code = params[:areacode]
      address.zip_code = params[:zipcode]
      address.rurban_code = params[:rurbancode]
      school.address = address

      school.address.region = Region.find(params[:region])
      school.address.province = Province.find(params[:province])
      school.address.town = Town.find(params[:town])
      school.address.save
      school.save!
      redirect_to schools_path
    else
      @school = School.new
      @regions = []
      @provinces = []
      @towns = []

      regions = Region.find(:all, :order => "name ASC")
      regions.each do |r|
---
SELECT * FROM `schools` WHERE (`schools`.`id` = 0)
SELECT * FROM `regions` ORDER BY name ASC


      regions.first.provinces.each do |r|
        @provinces << [ r.name, r.id ]
      end unless regions.first.provinces.empty?
---
SELECT count(*) AS count_all FROM `provinces` WHERE (`provinces`.region_id = 2)

  def edit
    @school = School.find(params[:id])
    @regions = []
    @provinces = []
    @towns = []
    regions = Region.find(:all, :order => "name ASC")
    regions.each do |r|
      @regions << [ r.name, r.id ]
    end

    provinces = Province.find(:all, :order => "name ASC")
    provinces.each do |r|
      @provinces << [ r.name, r.id ]
    end

    towns = Town.find(:all, :order => "name ASC")
    towns.each do |r|
---
SELECT * FROM `schools` WHERE (`schools`.`id` = 133)
SELECT * FROM `regions` ORDER BY name ASC
SELECT * FROM `provinces` ORDER BY name ASC
SELECT * FROM `towns` ORDER BY name ASC