test/app/controllers/sessions_controller.rb

  def authenticate
    @user = User.find(:first, :conditions => ["username=? and password=?", params[:user]['username'], params[:user]['password']]) rescue nil
---
SELECT * FROM `users` WHERE (is_active='1' and username='' and password='') LIMIT 1