test/app/controllers/status_reports_controller.rb

SELECT * FROM `schools` WHERE (`schools`.`id` = 133)
---
  def index
    @applicants = Applicant.search(params[:search], params[:page], current_user.school)