test/app/controllers/students_controller.rb

  def index
    if current_user.role_code == "registrar"
      @students = Student.search(params[:search], params[:page], current_user.school)
---
SELECT * FROM `schools` WHERE (`schools`.`id` = 1094)
SELECT * FROM `students` WHERE (school_id = 1094 and ( firstname like '%%' or lastname like '%%' or middlename like '%%')) ORDER BY lastname LIMIT 0, 20
SELECT count(*) AS count_all FROM `students` WHERE (school_id = 1094 and ( firstname like '%%' or lastname like '%%' or middlename like '%%'))

  def newapplication
    @student = Student.find(params[:id])
    preload_form_data

    @add_provinces = []
    @add_towns = []
    provinces = Province.find(:all, :conditions => ["region_id = ?", @student.region_id])
    provinces.each do |p|
      @add_provinces << [p.name, p.id]
    end
    towns = Town.find(:all, :conditions => ["province_id = ?", @student.province_id])
---
SELECT * FROM `students` WHERE (`students`.`id` = 11)
SELECT * FROM `provinces` WHERE (region_id = 10)
SELECT * FROM `regions`
SELECT * FROM `towns` WHERE (province_id = 1)

  def view
    preload_form_data
    @student = Student.find(params[:id])
    @applicants = Applicant.find(:all, :conditions => ["student_id = ?", @student.id])
    @exams = Examinee.find(:all, :conditions => ["student_id = ?", @student.id])
---
SELECT * FROM `students` WHERE (`students`.`id` = 11)
SELECT * FROM `examinees` WHERE (student_id = 11)

  def new
    @student = Student.new
    preload_form_data

    if request.post?
      student = Student.new(params[:student])
      student.created_by = current_user
      student.region_id = params[:address_region_id]
      student.province_id = params[:address_province_id]
      student.town_id = params[:address_town_id]
      student.date_of_birth = "#{params[:dob_year]}-#{params[:dob_month]}-#{params[:dob_day]}".to_date
      student.pob_region_id = params[:pob_region_id]
      student.pob_province_id = params[:pob_province_id]
      student.pob_town_id = params[:pob_town_id]
      student.school_id = current_user.school_id
      student.review_center1 = params[:review_center1]
      student.review_center2 = params[:review_center2]
      student.review_center3 = params[:review_center3]
      student.review_school1 = params[:review_school1]
      student.review_school2 = params[:review_school2]
      student.review_school3 = params[:review_school3]

      # 032:2554645
      student.telephone = "#{params[:telno_code]}:#{params[:telno_number]}"
      # 0919:5657898
      student.mobile_no = "#{params[:mobile_network]}:#{params[:mobile_number]}"


      duplicates = Student.check_duplicate(current_user.school, { :firstname => student.firstname, :lastname => student.lastname, :dob => student.date_of_birth.to_date.to_s})
---
INSERT INTO `students` (`pob_street`, `review_school1`, `province_id`, `mobile_no`, `pob_region_id`, `review_school2`, `review_center1`, `created_at`, `released_at`, `zip_code`, `area_code`, `spouse_citizenship_id`, `convicted_file`, `review_school3`, `review_center2`, `has_other_degree`, `pob_area_code`, `mother`, `review_center3`, `updated_at`, `middlename`, `country_id`, `lastname`, `street`, `father_citizenship_id`, `created_by`, `sex`, `region_id`, `firstname`, `year`, `date_of_birth_place`, `pob_province_id`, `pob_town_id`, `pob_zip_code`, `pob_rurban_code`, `convicted`, `foster_id`, `updated_by`, `telephone`, `date_of_birth`, `marital_status`, `mother_citizenship_id`, `course_id`, `street_brgy`, `town_id`, `email`, `spouse`, `father`, `school_id`) VALUES('mabolo 2', NULL, 1, '098098', 10, NULL, NULL, '2010-05-23 15:55:30', NULL, NULL, NULL, '170', '1', NULL, NULL, 1, NULL, NULL, NULL, '2010-05-23 15:55:30', 'l', '170', 'locsin', 'mabolo', '170', 1, 'female', 10, 'angel', 'first1', NULL, 1, 1, NULL, NULL, '1', NULL, NULL, '2487', '1901-01-01', 'single', NULL, 334, NULL, 1, 'angel@yahoo.com', '', 'father', 1094)
SELECT * FROM `regions`
SELECT * FROM `review_centers`
SELECT * FROM `review_schools`
SELECT * FROM `schools` WHERE (`schools`.`id` = 1094)

      student.save

      if params[:degree] == "0"
        params[:other_courses].each do |deg|
---
SELECT * FROM `courses`

  def new_application
    student = Student.find(params[:id])


      student.region_id = params[:address_region_id]
      student.province_id = params[:address_province_id]
      student.town_id = params[:address_town_id]
      student.date_of_birth = "#{params[:dob_year]}-#{params[:dob_month]}-#{params[:dob_day]}".to_date
      student.pob_region_id = params[:pob_region_id]
      student.pob_province_id = params[:pob_province_id]
      student.pob_town_id = params[:pob_town_id]
      student.school_id = current_user.school_id
      student.review_center1 = params[:review_center1]
      student.review_center2 = params[:review_center2]
      student.review_center3 = params[:review_center3]
      student.review_school1 = params[:review_school1]
      student.review_school2 = params[:review_school2]
      student.review_school3 = params[:review_school3]

      duplicates = Student.check_duplicate(current_user.school, { :firstname => student.firstname, :lastname => student.lastname, :dob => student.date_of_birth.to_date.to_s})
      if duplicates.length > 0
        flash[:error] = "Student already exists!"
        redirect_to students_path and return
      end

      student.save
---
SELECT * FROM `students` WHERE (LCASE(firstname) like 'oiu' and LCASE(lastname) like 'conde' and date_of_birth = '1918-08-01')
SELECT * FROM `schools` WHERE (`schools`.`id` = 1094)
UPDATE `students` SET `updated_at` = '2010-05-23 15:30:08', `date_of_birth` = '1918-08-01' WHERE `id` = 19

  def update_province_select_address
    @region, @provinces, @towns = [], [], []
    @region = Region.find(params[:region_id])
    @region.provinces.find(:all, :order => "name asc").each do |p|
      @provinces << [p.name.titleize, p.id]
    end

    @region.provinces.first.towns.each do |t|
---
SELECT * FROM `regions` WHERE (`regions`.`id` = 10)
SELECT * FROM `provinces` WHERE (`provinces`.region_id = 10)
SELECT * FROM `towns` WHERE (`towns`.province_id = 1)

  def update_province_select_pob
    @region, @pob_provinces, @pob_towns = [], [], []
    @region = Region.find(params[:region_id])
    @region.provinces.find(:all, :order => "name asc").each do |p|
      @pob_provinces << [p.name.titleize, p.id]
    end

    @region.provinces.first.towns.find(:all, :order => "name asc").each do |t|
---
SELECT * FROM `regions` WHERE (`regions`.`id` = 9)
SELECT * FROM `provinces` WHERE (`provinces`.region_id = 9)
SELECT * FROM `towns` WHERE (`towns`.province_id = 1)

  def repeater
    @students = []
    if params[:search]
      if current_user.role_code == "registrar"
        @students = Student.find_repeater(params[:search], params[:page],  current_user.school)
---
SELECT * FROM `schools` WHERE (`schools`.`id` = 1094)
SELECT * FROM `students` WHERE (school_id = 1094 and ( firstname like '%locsin%' or lastname like '%locsin%' or middlename like '%locsin%')) ORDER BY lastname LIMIT 0, 20
SELECT count(*) AS count_all FROM `students` WHERE (school_id = 1094 and ( firstname like '%%' or lastname like '%%' or middlename like '%%'))

  def load_countries
    @countries = []
    countries = Country.find(:all, :order => "name ASC")
    countries.each do |c|
---
SELECT * FROM `countries` WHERE (`countries`.`id` = 7)
SELECT * FROM `countries` ORDER BY name ASC

  def load_civil_statuses
    @civilstatus = []
    civilstatus = CivilStatus.find(:all, :order => "name ASC")
    civilstatus.each do |c|
---
SELECT * FROM `civil_statuses` ORDER BY name ASC

  def load_courses
    @courses = []
    courses = Course.find(:all)
    courses.each do |c|
---
SELECT * FROM `courses` WHERE (`courses`.`id` = 3)
SELECT * FROM `courses` ORDER BY name asc

  def load_review_schools
    @review_schools = []
    review_schools = ReviewSchool.find(:all)
    review_schools.each do |r|
---
SELECT * FROM `schools` WHERE (`schools`.`id` = 1094)
SELECT * FROM `review_schools`
SELECT * FROM `schools` ORDER BY name asc

  def load_review_centers
    @review_centers = []
    review_centers = ReviewCenter.find(:all)
    review_centers.each do |r|
---
SELECT * FROM `review_centers`