app/controllers/cashiers_controller.rb

SELECT * FROM `payments` WHERE (created_by = 4 and examination_schedule_id = 2) ORDER BY created_at DESC
---
  def history
    @payments = Payment.find(:all,
                             :conditions => ["created_by = ? and examination_schedule_id = ?", current_user.id, current_examination_schedule.id],
                             :order => "created_at DESC")

SELECT * FROM `prices` WHERE (`prices`.`examination_type` = 'conditioned') LIMIT 1
INSERT INTO `payments` (`student_id`, `created_at`, `updated_at`, `application_id`, `or_number`, `created_by`, `updated_by`, `price_id`, `examination_schedule_id`) VALUES(19, '2010-05-23 15:36:48', '2010-05-23 15:36:48', 1, '23423423', 4, NULL, 3, 2)
INSERT INTO `examinees` (`student_id`, `rating`, `exam1`, `exam2`, `created_at`, `exam3`, `exam4`, `updated_at`, `exam5`, `created_by`, `perrc`, `exam_status`, `updated_by`, `test_center_id`, `exam_number`, `examination_type`, `examination_schedule_id`) VALUES(19, NULL, NULL, NULL, '2010-05-23 15:36:48', NULL, NULL, '2010-05-23 15:36:48', NULL, 4, NULL, NULL, 0, NULL, NULL, 'conditioned', 2)
---
  def pay
    app = Applicant.find(params[:id])
    app.status = true
    app.save

    price = Price.find_by_examination_type(app.examination_type)
    payment = Payment.new
    payment.application_id = params[:id]
    payment.student_id = app.student_id
    payment.or_number = params[:or_number]
    payment.examination_schedule_id = current_examination_schedule.id
    payment.created_by = current_user.id
    payment.price_id = price.id


    if payment.save
      #create examinees record
      examinee = Examinee.new
      examinee.student_id = app.student_id
      examinee.examination_type = app.examination_type
      examinee.examination_schedule_id = current_examination_schedule.id
      examinee.created_by = current_user.id