app/controllers/nles_controller.rb

SELECT * FROM `schools` WHERE (`schools`.`id` = 1094)
SELECT * FROM `payments` WHERE (application_id IN (1))
---
  def paid_examinees
    applications = Applicant.find(:all, :conditions => ["school_id = ? and is_completed = ? and examination_schedule_id = ?", current_user.school_id, true, current_examination_schedule.id])
    app_ids = applications.map(&:id)
    @payments = Payment.find(:all, :conditions => ["application_id IN (?)", app_ids])

SELECT * FROM `students` WHERE (`students`.`id` = 19)
SELECT * FROM `examinees` WHERE (student_id in (1,2,3,4,5,6,7,8,9,10,11,12,13,14,17,18,19,20,21,22,23) and examination_schedule_id = 2)
---
  def results
    students = Student.find(:all, :conditions => ["school_id = ?", current_user.school_id])
    student_ids = students.map(&:id)
    @examinees = Examinee.find(:all, :conditions => ["student_id in (?) and examination_schedule_id = ?", student_ids, current_examination_schedule.id])