app/controllers/noas_controller.rb

SELECT * FROM `examinees` WHERE (perrc IS NOT NULL)
---
  def history
    @examinees = Examinee.find(:all, :conditions => ["perrc IS NOT NULL"])

SELECT * FROM `test_centers`
---
  def load_test_centers
    @test_centers = []
    testcenters = TestCenter.find(:all)
    testcenters.each do |tc|